import * as yup from "yup"

const regx = {
  password: /^(?=.*[0-9])(?=.*[a-z])(?=.*[A-Z])(?=.*[!@#&()–/[{}\]:;',?/*~$^+=<>]).+$/,
};

export const email = yup
  .string()
  .trim()
  .required("Email обов'язкове поле")
  .matches(
    // Повна кастомна регулярка згідно з умовами
    /^[a-zA-Z0-9!#$%&'*+/=?^_`{|}~-](?:\.?[a-zA-Z0-9!#$%&'*+/=?^_`{|}~-])*@[a-zA-Z0-9](?:[a-zA-Z0-9-]*[a-zA-Z0-9])?(?:\.[a-zA-Z0-9](?:[a-zA-Z0-9-]*[a-zA-Z0-9])?)+$/,
    'Email повинен бути валідним'
  )
  .test(
    'local-part-length',
    'Локальна частина email повинна містити від 1 до 35 символів',
    (value) => {
      if (!value) return false;
      const local = value.split('@')[0];
      if(local) {
        return local.length >= 1 && local.length <= 35;
      }
    }
  )
  .test(
    'domain-part-length',
    'Доменна частина email повинна містити від 3 до 35 символів',
    (value) => {
      if (!value) return false;
      const domain = value.split('@')[1];
      if(domain) {
        return domain?.length >= 3 && domain.length <= 35;
      }
    }
  );

export const password = yup
  .string()
  .trim()
  .required("Пароль обов'язкове поле")
  .min(8, "Пароль має містити щонайменше 8 символів")
  .max(16, "Пароль має містити не більше 16 символів")
  .matches(
    /^[A-Za-z\d!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]{8,16}$/,
    "Пароль повинен містити тільки латинські літери, цифри або спецсимволи"
  );

export const password_confirm = yup.string()
    .trim()
    .required("Підтвердження пароля є обов'язковим")
    .min(8, "Підтвердження пароля має містити щонайменше 8 символів")
    .max(16, "Підтвердження пароля має містити не більше 16 символів")
    .matches(
      /^[A-Za-z\d!@#$%^&*()_+\-=\[\]{};':"\\|,.<>\/?]{8,16}$/,
      "Підтвердження пароля повинен містити тільки латинські літери, цифри або спецсимволи"
    )
    .oneOf([yup.ref("password")], "Паролі не співпадають");

export const username = yup.string()
  .trim()
  .required("Ім'я обов'язкове поле")
  .min(1, "Ім’я повинно містити щонайменше 1 символ")
  .max(50, "Ім’я не може містити більше 50 символів")
  .matches(
    /^(?!-)(?!.*--)(?!.*[^A-Za-zА-Яа-яІіЇїЄєҐґ'-])(?!.*\d)[A-Za-zА-Яа-яІіЇїЄєҐґ]+(?:-[A-Za-zА-Яа-яІіЇїЄєҐґ]+)*$/,
    "Ім’я може містити лише літери кирилиці, латиниці та дефіс (не на початку і не в кінці, без цифр і спецсимволів)"
  );


export const surname = yup.string()
  .trim()
  .required("Прізвище обов'язкове поле")
  .min(1, "Прізвище повинно містити щонайменше 1 символ")
  .max(50, "Прізвище не може містити більше 50 символів")
  .matches(
    /^(?!-)(?!.*--)(?!.*[^A-Za-zА-Яа-яІіЇїЄєҐґ'-])(?!.*\d)[A-Za-zА-Яа-яІіЇїЄєҐґ]+(?:-[A-Za-zА-Яа-яІіЇїЄєҐґ]+)*$/,
    "Прізвище може містити лише літери кирилиці, латиниці та дефіс (не на початку і не в кінці, без цифр і спецсимволів)"
  );

export const verification_code = yup.string()
  .trim()
  .required("Код підтвердження обов'язкове поле")
  .matches(/^\d+$/, "Код підтвердження повинен містити лише цифри")
  .length(6, "Код підтвердження повинен містити рівно 6 символів");